In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [4]:
dframe = DataFrame({"k1":['X','X','Y','Y','Z'],
                    "k2":['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [5]:
dframe

   dataset1  dataset2 k1     k2
0 -0.031563  0.665214  X  alpha
1 -0.125964  1.117438  X   beta
2 -1.992515 -0.371642  Y  alpha
3 -0.209428 -0.687077  Y   beta
4 -0.405704 -0.824162  Z  alpha

In [6]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [7]:
group1

In [8]:
group1.mean()

k1
X   -0.078763
Y   -1.100972
Z   -0.405704
Name: dataset1, dtype: float64

In [9]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [10]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -0.125964
    JAN   -1.992515
NY  FEB   -0.209428
    JAN   -0.218633
Name: dataset1, dtype: float64

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.078763  0.891326
Y  -1.100972 -0.529360
Z  -0.405704 -0.824162

In [12]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.031563  0.665214
   beta  -0.125964  1.117438
Y  alpha -1.992515 -0.371642
   beta  -0.209428 -0.687077
Z  alpha -0.405704 -0.824162

In [13]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [14]:
for name, group in dframe.groupby('k1'):
    print "This is the %s group" %name
    print group
    print '\n'

This is the X group
   dataset1  dataset2 k1     k2
0 -0.031563  0.665214  X  alpha
1 -0.125964  1.117438  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -1.992515 -0.371642  Y  alpha
3 -0.209428 -0.687077  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -0.405704 -0.824162  Z  alpha

In [16]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print "KEY1 = %s   KEY2 %s" %(k1, k2)
    print group
    print "\n"

KEY1 = X   KEY2 alpha
   dataset1  dataset2 k1     k2
0 -0.031563  0.665214  X  alpha


KEY1 = X   KEY2 beta
   dataset1  dataset2 k1    k2
1 -0.125964  1.117438  X  beta


KEY1 = Y   KEY2 alpha
   dataset1  dataset2 k1     k2
2 -1.992515 -0.371642  Y  alpha


KEY1 = Y   KEY2 beta
   dataset1  dataset2 k1    k2
3 -0.209428 -0.687077  Y  beta


KEY1 = Z   KEY2 alpha
   dataset1  dataset2 k1     k2
4 -0.405704 -0.824162  Z  alpha

In [19]:
group_dict = dict(list(dframe.groupby('k1')))

In [21]:
group_dict['X']

   dataset1  dataset2 k1     k2
0 -0.031563  0.665214  X  alpha
1 -0.125964  1.117438  X   beta

In [22]:
group_dice_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [23]:
group_dice_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.031563  0.665214
 1 -0.125964  1.117438
 2 -1.992515 -0.371642
 3 -0.209428 -0.687077
 4 -0.405704 -0.824162, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [24]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.665214
   beta   1.117438
Y  alpha -0.371642
   beta  -0.687077
Z  alpha -0.824162

In [20]:
dframe

   dataset1  dataset2 k1     k2
0 -0.031563  0.665214  X  alpha
1 -0.125964  1.117438  X   beta
2 -1.992515 -0.371642  Y  alpha
3 -0.209428 -0.687077  Y   beta
4 -0.405704 -0.824162  Z  alpha